from rich.layout import Layout
from rich.panel import Panel
from rich import print as rprint
from rich.console import Console

info_header = '''
██╗███╗   ██╗███████╗ ██████╗ ██████╗ ███╗   ███╗ █████╗ ████████╗██╗ ██████╗ ███╗   ██╗
██║████╗  ██║██╔════╝██╔═══██╗██╔══██╗████╗ ████║██╔══██╗╚══██╔══╝██║██╔═══██╗████╗  ██║
██║██╔██╗ ██║█████╗  ██║   ██║██████╔╝██╔████╔██║███████║   ██║   ██║██║   ██║██╔██╗ ██║
██║██║╚██╗██║██╔══╝  ██║   ██║██╔══██╗██║╚██╔╝██║██╔══██║   ██║   ██║██║   ██║██║╚██╗██║
██║██║ ╚████║██║     ╚██████╔╝██║  ██║██║ ╚═╝ ██║██║  ██║   ██║   ██║╚██████╔╝██║ ╚████║
╚═╝╚═╝  ╚═══╝╚═╝      ╚═════╝ ╚═╝  ╚═╝╚═╝     ╚═╝╚═╝  ╚═╝   ╚═╝   ╚═╝ ╚═════╝ ╚═╝  ╚═══╝
                                                                                    
'''


RTX4090_ach = '''
╭━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━╮
│                ░█▀▄░▀█▀░█░█░█░█░▄▀▄░▄▀▄░▄▀▄                 │
│                ░█▀▄░░█░░▄▀▄░░▀█░█/█░░▀█░█/█                 │
│                ░▀░▀░░▀░░▀░▀░░░▀░░▀░░▀▀░░░▀░                 │             
│       Скачать крутую видеокарту без СМС и регистрации       │
╰━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━╯
'''

NOT_READ_ME = '''
╔═════════════════════════════════════════════════════════════╗
║                ПОЛЬЗОВАТЕЛЬСКОЕ СОГЛАЩЕНИЕ                  ║
╠═════════════════════════════════════════════════════════════╣
║Имея данный софт вы обязаны соблюдать следующие правила      ║
║                                                             ║
║1)Принимаете ответственность за все свои действия на себя.   ║
║2)Обязуетесь в случае публикованиях программы на различных   ║
║информационных информационных ресурсов указывать тгк автора  ║
║https://t.me/ziyou_off   либо  https://t.me/+To5Lgt_Fx70zZDMy║
║3)Не выодовать себя за автора программы                      ║
║4)Так же категорически запрещается продавть данную программу ║
╚═════════════════════════════════════════════════════════════╝   
'''

ach = '''
░█▀█░█▀▀░█░█░▀█▀░█▀▀░█░█░█▀▀░█▄█░█▀▀░█▀█░▀█▀░█▀▀
░█▀█░█░░░█▀█░░█░░█▀▀░▀▄▀░█▀▀░█░█░█▀▀░█░█░░█░░▀▀█
░▀░▀░▀▀▀░▀░▀░▀▀▀░▀▀▀░░▀░░▀▀▀░▀░▀░▀▀▀░▀░▀░░▀░░▀▀▀
'''

layout = Layout()

layout.split_column(
      Layout(name="header"),
      Layout(name="upper"),
      Layout(name="lower")
    )

layout["upper"].split_row(
      Layout(name="up_left"),
      Layout(name="up_right")
    )

layout["lower"].split_row(
      Layout(name="low_left"),
      Layout(name="low_right")
    )

rprint(layout)